fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалиста/ВКМ_КалендарьСпециалиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_КалендарьСпециалиста</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВКМ_КатегорииСотрудников/ВКМ_КатегорииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииСотрудников</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ВКМ_Сотрудники/ВКМ_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>EnumRef.ВКМ_КатегорииСотрудников</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалиста/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Календарь = ТекущаяДата();

	НачальнаяНастройкаПланировщика();

	ОбновитьФормуКалендаря(Календарь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ОбслуживаниеКлиентов" Тогда
		Календарь = Параметр.ДатаПроведенияРабот;
		ОбновитьФормуКалендаря(Календарь);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаКалендарьСпециалиста" Тогда

		ОбновитьФормуКалендаря(Календарь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	
	ОбновитьФормуКалендаря(Календарь);
		
КонецПроцедуры

&НаКлиенте
Процедура КалендарьСпециалистовПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДокументСсылка = Элемент.ВыделенныеЭлементы[0].Значение;
	Ключ = Новый Структура;
	Ключ.Вставить("Ключ", ДокументСсылка);
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиентов.ФормаОбъекта", Ключ);
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьСпециалистовПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ДатаПроведенияРабот", Начало);
	ЗначенияЗаполнения.Вставить("ВремяНачалаРабот", Начало);
	ЗначенияЗаполнения.Вставить("ВремяОкончанияРабот", Конец);
	ЗначенияЗаполнения.Вставить("Специалист", ЗначенияИзмерений.Получить("Специалист"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиентов.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры
   
&НаКлиенте
Процедура КалендарьСпециалистовПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	
	ЭлементыРедактирования = Новый Структура;
	ЭлементыРедактирования.Вставить("ВремяНачалаРабот", Элемент.ВыделенныеЭлементы[0].Начало);
	ЭлементыРедактирования.Вставить("ВремяОкончанияРабот", Элемент.ВыделенныеЭлементы[0].Конец);
	ЭлементыРедактирования.Вставить("Ссылка", Элемент.ВыделенныеЭлементы[0].Значение);
	
	Специалист = Элемент.ВыделенныеЭлементы[0].ЗначенияИзмерений.Получить("Специалист");
	ЭлементыРедактирования.Вставить("Специалист", Специалист);
	
	РедактированиеДокументаНаСервере(ЭлементыРедактирования);

	ОбновитьФормуКалендаря(Календарь);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьФормуКалендаря(Дата)
	
	ЗаполнитьПланировщикНаСервере(Дата);
	
	ОбновлениеКалендаряСпециалиста(Дата);
	
	ЗаполнитьДиаграмму(Дата);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПланировщикНаСервере(Дата)
	
	КалендарьСпециалистов.Элементы.Очистить();
	
	ИзмеренияПланировщика = КалендарьСпециалистов.Измерения;
	ИзмеренияПланировщика.Очистить();
	
	ИзмерениеСпециалист = ИзмеренияПланировщика.Добавить("Специалист");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_Сотрудники.Фамилия КАК Фамилия,
		|	ВКМ_Сотрудники.Имя КАК Имя,
		|	ВКМ_Сотрудники.Отчество КАК Отчество,
		|	ВКМ_Сотрудники.Представление КАК Представление,
		|	ВКМ_Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
		|ГДЕ
		|	ВКМ_Сотрудники.Категория = ЗНАЧЕНИЕ(Перечисление.ВКМ_КатегорииСотрудников.Специалист)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НовыйСпециалист = ИзмерениеСпециалист.Элементы.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		НовыйСпециалист.Текст = ВыборкаДетальныеЗаписи.Представление;
		
	КонецЦикла;

	ДатаНачала = НачалоДня(Дата);
	ДатаОкончания = КонецДня(Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка КАК ДокументОбслуживаниеКлиентов,
		|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиентов.ОписаниеПроблемы КАК ОписаниеПроблемы,
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот КАК ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиентов.Номер КАК Номер,
		|	ВКМ_ОбслуживаниеКлиентов.Дата КАК Дата,
		|	ВКМ_ОбслуживаниеКлиентов.КодЦвета КАК КодЦвета
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ВремяНачала = ДатаНачала + ПеревестиВремяВСекунды(ВыборкаДетальныеЗаписи.ВремяНачалаРабот);
		ВремяОкончания = ДатаНачала + ПеревестиВремяВСекунды(ВыборкаДетальныеЗаписи.ВремяОкончанияРабот);
		
		Соответствия = Новый Соответствие;
		Соответствия.Вставить("Специалист", ВыборкаДетальныеЗаписи.Специалист);
		
		НовыйЭлемент = КалендарьСпециалистов.Элементы.Добавить(ВремяНачала, ВремяОкончания);
		НовыйЭлемент.ЗначенияИзмерений = Новый ФиксированноеСоответствие(Соответствия);
		
		ШрифтДляДок = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,, 10, Истина);
		НомерДокумента = Строка(Число(ВыборкаДетальныеЗаписи.Номер));
		ДатаДокумента = Формат(ВыборкаДетальныеЗаписи.Дата, "ДФ=dd.MM.yyyy");
		СтрокаДок = СтрШаблон("Заявка №%1 от %2", НомерДокумента, ДатаДокумента);
		ФормСтрокаДок = Новый ФорматированнаяСтрока(СтрокаДок, ШрифтДляДок);

		ШрифтДляНаименований = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,, Истина);
		ШрифтДляЭлементов = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,,, Истина, Истина);

		СтрокаВремяНаименование = "Время работы:";
		ФормСтрокаВремяНаименование = Новый ФорматированнаяСтрока(СтрокаВремяНаименование, ШрифтДляНаименований);

		СтрокаВремя = СтрШаблон("с %1 по %2", Лев(Формат(ВыборкаДетальныеЗаписи.ВремяНачалаРабот, "ДЛФ=T"), 5),
				Лев(Формат(ВыборкаДетальныеЗаписи.ВремяОкончанияРабот, "ДЛФ=T"), 5));
		ФормСтрокаВремя = Новый ФорматированнаяСтрока(СтрокаВремя, ШрифтДляЭлементов);
		
		СтрокаКлиентНаименование = "Клиент:";
		ФормСтрокаКлиентНаименование = Новый ФорматированнаяСтрока(СтрокаКлиентНаименование, ШрифтДляНаименований);

		СтрокаКлиент = Строка(ВыборкаДетальныеЗаписи.Клиент);
		ФормСтрокаКлиент = Новый ФорматированнаяСтрока(СтрокаКлиент, ШрифтДляЭлементов);
		
		СтрокаДоговорНаименование = "Договор:";
		ФормСтрокаДоговорНаименование = Новый ФорматированнаяСтрока(СтрокаДоговорНаименование, ШрифтДляНаименований);

		СтрокаДоговор = Строка(ВыборкаДетальныеЗаписи.Договор);
		ФормСтрокаДоговор = Новый ФорматированнаяСтрока(СтрокаДоговор, ШрифтДляЭлементов);

		СтрокаПроблемыНаименование = "Описание Проблемы:";
		ФормСтрокаПроблемыНаименование = Новый ФорматированнаяСтрока(СтрокаПроблемыНаименование, ШрифтДляНаименований);

		СтрокаПроблемы = Строка(ВыборкаДетальныеЗаписи.ОписаниеПроблемы);
		ФормСтрокаПроблемы = Новый ФорматированнаяСтрока(СтрокаПроблемы, ШрифтДляЭлементов);

		Массив = Новый Массив;
		Массив.Добавить(ФормСтрокаДок);
		Массив.Добавить(Символы.ПС);
		Массив.Добавить(ФормСтрокаВремяНаименование);
		Массив.Добавить(Символы.ПС);
		Массив.Добавить(ФормСтрокаВремя);
		Массив.Добавить(Символы.ПС);
		Массив.Добавить(ФормСтрокаКлиентНаименование);
		Массив.Добавить(Символы.ПС);
		Массив.Добавить(ФормСтрокаКлиент);
		Массив.Добавить(Символы.ПС);
		Массив.Добавить(ФормСтрокаДоговорНаименование);
		Массив.Добавить(Символы.ПС);
		Массив.Добавить(ФормСтрокаДоговор);
		Массив.Добавить(Символы.ПС);
		Массив.Добавить(ФормСтрокаПроблемыНаименование);
		Массив.Добавить(Символы.ПС);
		Массив.Добавить(ФормСтрокаПроблемы);
              
		СтрокаТекста = Новый ФорматированнаяСтрока(Массив);		
		
		ЦветФонаЗаявки = ВКМ_ОбслуживаниеКлиентов.ПолучитьЦветRGB(ВыборкаДетальныеЗаписи.КодЦвета);
		ЦветТекстаЦаявки = ПолучитьЦветТекста(ЦветФонаЗаявки);
		
		НовыйЭлемент.Текст = СтрокаТекста;
		НовыйЭлемент.ЦветФона = ЦветФонаЗаявки;
		НовыйЭлемент.ЦветТекста = ЦветТекстаЦаявки;
		НовыйЭлемент.Значение = ВыборкаДетальныеЗаписи.ДокументОбслуживаниеКлиентов;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦветТекста(ЦветФонаЗаявки)
	
	Красный = ЦветФонаЗаявки.Красный;
	Зеленый = ЦветФонаЗаявки.Зеленый;
	Синий = ЦветФонаЗаявки.Синий;
	
	Контрастность = (Красный * 299 + Зеленый * 587 + Синий * 114) / 1000;
	
	Если Контрастность > 127 Тогда
		ЦветRGB = Новый Цвет(0, 0, 0);	
	Иначе
		ЦветRGB = Новый Цвет(255, 255, 255);
	КонецЕсли;
	
	Возврат ЦветRGB;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПеревестиВремяВСекунды(Время)
	
	Возврат 60 * (Час(Время) * 60 + Минута(Время)) + Секунда(Время);
	
КонецФункции

&НаСервере
Процедура ОбновлениеКалендаряСпециалиста(Дата)
	
	КалендарьСпециалистов.ТекущиеПериодыОтображения.Очистить();
	
	КалендарьСпециалистов.ОтображениеВремениЭлементов = ОтображениеВремениЭлементовПланировщика.НеОтображать;
	
	НачалоПериода = НачалоДня(Дата);
	КонецПериода = КонецДня(Дата);
	
	КалендарьСпециалистов.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
	Заголовок = "Календарь работ специалистов " + ПредставлениеПериода(НачалоПериода, КонецПериода);

КонецПроцедуры

&НаСервере
Процедура НачальнаяНастройкаПланировщика()

	КалендарьСпециалистов.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
	КалендарьСпециалистов.КратностьПериодическогоВарианта = 24;
	
	КалендарьСпециалистов.ОтступСНачалаПереносаШкалыВремени = 9;
	КалендарьСпециалистов.ОтступСКонцаПереносаШкалыВремени = 5;
	
	КалендарьСпециалистов.ВыравниватьГраницыЭлементовПоШкалеВремени = Ложь;
	
	КалендарьСпециалистов.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='дддд, д ММММ гггг'";
	
КонецПроцедуры

&НаСервере
Процедура РедактированиеДокументаНаСервере(ЭлементыРедактирования)
	
	ДокументСсылка = ЭлементыРедактирования.Ссылка;
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	ДокументОбъект.ВремяНачалаРабот = ЭлементыРедактирования.ВремяНачалаРабот;
	ДокументОбъект.ВремяОкончанияРабот = ЭлементыРедактирования.ВремяОкончанияРабот;
	ДокументОбъект.Специалист = ЭлементыРедактирования.Специалист;
	
	ДокументОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграмму(Дата)
	
	ДатаНачала = НачалоДня(Дата);
	ДатаОкончания = КонецДня(Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот КАК ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
		|	СУММА(РАЗНОСТЬДАТ(ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот, ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот, МИНУТА)) КАК ВремяРаботы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентов.Специалист,
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Диаграмма = ЭтотОбъект.ДиаграммаВремя;
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	Диаграмма.КоличествоТочек = 1;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Серия = Диаграмма.УстановитьСерию(ВыборкаДетальныеЗаписи.Специалист);
		Диаграмма.УстановитьЗначение(0, Серия, ВыборкаДетальныеЗаписи.ВремяРаботы);
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры
#КонецОбласти
